// #include <iostream>
// using namespace std;

// int main() {
//     int chislo, a = 0;
//     cout << "Введите число: ";
//     cin >> chislo;
//     int chislo2, b = 0;
//     cout << "Введите число2: ";
//     cin >> chislo2;
//     for (; a < 1; a++)
//     {
//         cout << (char)chislo;
//     }
//     cout << endl;
//     for (; b < 1; b++)
//     {
//         cout << (char)chislo2;
//     }
//     cout << endl;
//     return 0;
// }

// #include <iostream>

// // using namespace std;
// int main ()
// {
//     setlocale (LC_ALL, "en_US.UTF-8");
//     int n[1][6]={
//                     {188,188,188,188,188,188}
//                     // {201,203,203,203,203,203,203,203,187}, // массив  рисунка из символов таблицы ASCII
//                     // {200,202,202,202,202,202,202,202,188}
//                 };
//         for(int i=0; i<2;i++)  //цикл вывода рисунка
//         {
//         for(int j=0;j<9;j++) 
//             std::cout<<static_cast<char>(n[i][j]); //явное приведение типа (в старом стиле (char)n[i][j])
//             std::cout<<std::endl;
//         };
//         //cin.get();//строчно-ориентированная функция(метод) объекта cin, чтобы заморозить экран вывода
//         return 0;
// }

#include <iostream>

int main()
{
    //ставим локаль в 'С'
    setlocale(LC_ALL, "C");
    //выбрал понравившиеся нужные границы символов
    unsigned int a = 176;
    unsigned int b = 223;
    //создаем список символов для наглядности
    for (int i = a; i <= b; ++i)
    {
    std::cout << i << ": " << char(i) << "\n\n";
    }
    //выбираем понравившиеся нам символы и записываем в массив
    //я выбрал выравнивание по 11 символов
    int txt[] = { 201, 205, 205, 205, 205, 205, 205, 205, 205, 205, 187,
    186, 176, 176, 176, 176, 176, 176, 176, 176, 176, 186,
    186, 176, 219, 223, 219, 176, 219, 223, 219, 176, 186,
    186, 176, 219, 176, 219, 176, 219, 176, 219, 176, 186,
    186, 176, 219, 220, 219, 176, 219, 220, 219, 176, 186,
    186, 176, 176, 176, 176, 219, 176, 176, 176, 176, 186,
    186, 176, 219, 223, 223, 223, 223, 223, 219, 176, 186,
    186, 176, 219, 176, 176, 176, 176, 176, 219, 176, 186,
    186, 176, 176, 176, 176, 176, 176, 176, 176, 176, 186,
    204, 205, 205, 205, 205, 205, 205, 205, 205, 205, 185,
    186, 176, 70, 65, 75, 79, 86, 75, 65, 176, 186,
    186, 176, 176, 176, 57, 57, 57, 176, 176, 176, 186,
    200, 205, 205, 205, 205, 205, 205, 205, 205, 205, 188};

    unsigned int k = 1; //счетчик
    unsigned int j = 11; //каждый 'j' символ переносим строку
    unsigned int l = (sizeof(txt) / sizeof(txt[0])); //длина массива
    //цикл массива
    for (int i = 0; i < l; ++i)
    {
    //печатаем символ из таблицы ASCII
    std::cout << char(txt[i]);
    //если счетчик насчитал 'j' символов в строке
    if (k >= j)
    {
    std::cout << "\n"; //опускаем каретку
    k = 1; //сбрасываем счетчик
    continue; //переходим в начало цикла
    }
    ++k; // иначе увеличиваем счетчик на 1
    }
    return 0;
}