/* ********************************************************************************* */
/* * File: translet-km.cpp                          *      |File Checked|2|        * */
/* *                                                *                              * */
/* *                                                *   ██████╗ ██╗   ██╗████████╗ * */
/* * Last-In: 2022/04/23, 06:29:16 pm               *  ██╔═══██╗██║   ██║╚══██╔══╝ * */
/* *   In By: lmisti@romaniy11052001@gmail.com      *  ██║   ██║██║   ██║   ██║    * */
/* *                                                *  ██║   ██║██║   ██║   ██║    * */
/* * Last-Out: 2022/04/23, 06:29:19 pm              *  ╚██████╔╝╚██████╔╝   ██║    * */
/* *   Out By: lmisti@romaniy11052001@gmail.com     *   ╚═════╝  ╚═════╝    ╚═╝    * */
/* *                                                *                              * */
/* ********************************************************************************* */


#include<iostream>
using namespace std;

int main()
{
setlocale(LC_ALL, "Rus");
int m;
float km;
cout << "Перевод числа из метров в километры" << endl;
cout << "Введите число в метрах:" << endl;
cin>> m;
km =(float)m / 1000;

cout<< "Число в переводе: " << km;
cout<<" Км"<<endl;
}