/* ************************************************************************** */
/*                                                          LE - /            */
/*                                                              /             */
/*   translet-km.cpp                                  .::    .:/ .      .::   */
/*                                                 +:+:+   +:    +:  +:+:+    */
/*   By: lmistie <romaniy11052001@gmail.com>        +:+   +:    +:    +:+     */
/*                                                 #+#   #+    #+    #+#      */
/*   Created: 2022/04/23 16:41:38 by lmistie      #+#   ##    ##    #+#       */
/*   Updated: 2022/04/23 16:41:39 by lmistie     ###    #+. /#+    ###.fr     */
/*                                                         /                  */
/*                                                        /                   */
/* ************************************************************************** */

#include<iostream>
using namespace std;

int main()
{
setlocale(LC_ALL, "Rus");
int m;
float km;
cout << "Перевод числа из метров в километры" << endl;
cout << "Введите число в метрах:" << endl;
cin>> m;
km =(float)m / 1000;

cout<< "Число в переводе: " << km;
cout<<" Км"<<endl;
}