/* ********************************************************************************* */
/* * File: register.cpp                             *      |File Checked|2|        * */
/* *                                                *                              * */
/* *                                                *   ██████╗ ██╗   ██╗████████╗ * */
/* * Last-In: 2022/04/23, 06:27:56 pm               *  ██╔═══██╗██║   ██║╚══██╔══╝ * */
/* *   In By: lmisti@romaniy11052001@gmail.com      *  ██║   ██║██║   ██║   ██║    * */
/* *                                                *  ██║   ██║██║   ██║   ██║    * */
/* * Last-Out: 2022/04/23, 06:28:00 pm              *  ╚██████╔╝╚██████╔╝   ██║    * */
/* *   Out By: lmisti@romaniy11052001@gmail.com     *   ╚═════╝  ╚═════╝    ╚═╝    * */
/* *                                                *                              * */
/* ********************************************************************************* */


#include <iostream>
#include <locale>

using namespace std;

int main()
{
    char c;
    cout<<"Введите одну букву пожалуйста: "<<endl;
    cin>>c;
    c = c - 32;
    cout<<"Буква в вверхнем резистре: "<< c <<endl;
    return 0;
}