/* ************************************************************************** */
/*                                                          LE - /            */
/*                                                              /             */
/*   register.cpp                                     .::    .:/ .      .::   */
/*                                                 +:+:+   +:    +:  +:+:+    */
/*   By: lmistie <romaniy11052001@gmail.com>        +:+   +:    +:    +:+     */
/*                                                 #+#   #+    #+    #+#      */
/*   Created: 2022/04/23 16:41:31 by lmistie      #+#   ##    ##    #+#       */
/*   Updated: 2022/04/23 16:41:33 by lmistie     ###    #+. /#+    ###.fr     */
/*                                                         /                  */
/*                                                        /                   */
/* ************************************************************************** */

#include <iostream>
#include <locale>

using namespace std;

int main()
{
    char c;
    cout<<"Введите одну букву пожалуйста: "<<endl;
    cin>>c;
    c = c - 32;
    cout<<"Буква в вверхнем резистре: "<< c <<endl;
    return 0;
}