/* ********************************************************************************* */
/* * File: max_min_num.cpp                          *      |File Checked|2|        * */
/* *                                                *                              * */
/* *                                                *   ██████╗ ██╗   ██╗████████╗ * */
/* * Last-In: 2022/04/23, 08:15:56 pm               *  ██╔═══██╗██║   ██║╚══██╔══╝ * */
/* *   In By: lmisti@romaniy11052001@gmail.com      *  ██║   ██║██║   ██║   ██║    * */
/* *                                                *  ██║   ██║██║   ██║   ██║    * */
/* * Last-Out: 2022/04/23, 08:21:31 pm              *  ╚██████╔╝╚██████╔╝   ██║    * */
/* *   Out By: lmisti@romaniy11052001@gmail.com     *   ╚═════╝  ╚═════╝    ╚═╝    * */
/* *                                                *                              * */
/* ********************************************************************************* */

#include <iostream>

using namespace std;

int main ()
{
    setlocale (LC_ALL, "RUS");
    int num;
    cout<<"Большое и минимальное число"<<endl;
    cout<<"Введите число не больше 99: "<<endl;
    cin>>num;
    cout<<endl;
    if ((num/10)>(num%10))
    {
        cout<<num/10<<" - большая цифра "<<endl;
        cout<<num%10<<" - меньшая цифра "<<endl;
    }
    else {
        if ((num/10)<(num%10))
    {
        cout<<num%10<<" - большая цифра "<<endl;
        cout<<num/10<<" - меньшая цифра "<<endl;
    }
    else
    {
        cout<<"цифры равны\n";
    }
    }
        cout<<endl;
    return 0;
}