#include <iostream>
using namespace std;

int main()
{
    setlocale (LC_ALL, "rus");
    cout<<"\t\t\tДеление числа на разряды\n\n";
    int a;
    cout<<"Введите пятизначное число: ";
    cin>>a;
    cout<<"\n";
    if (a>=0 && a<=9999)
    {
        cout<<"Вы ввели неверное число. Число должно быть пятизначным.\n\n";
    }
    else
    {
        if (a>=100000)
        {
            cout<<"Вы ввели неверное число. Число должно быть пятизначным.\n\n";
        }
        else
        {
            cout<<"1 цифра равна "<<(a/10000)<<"\n";
            cout<<"2 цифра равна "<<(a/1000)%10<<"\n";  
            cout<<"3 цифра равна "<<(a/100)%10<<"\n";
            cout<<"4 цифра равна "<<(a/10)%10<<"\n";
            cout<<"5 цифра равна "<<a%10<<"\n";
            cout<<endl;
        return 0;
        }
    }
}